Revit 2024 API
ParameterTypeId.FamilyRotateWithComponent Property
 "Rotate with component"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId FamilyRotateWithComponent { get; }
Visual Basic
Public Shared ReadOnly Property FamilyRotateWithComponent As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ FamilyRotateWithComponent {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace